#+TITLE: Static Equilibrium Worksheet
#+NAME: Xirong "Ziky" Zhang

|-----------+--------------------+------------------+------------+---------------------+-------------------+------------+---------------------+-------------------+------------+---------------------+-------------------|
| Left Mass | Left mass distance | Left mass torque | Right mass | Right mass distance | Right mass torque | Right mass | Right mass distance | Right mass torque | Right mass | Right mass distance | Right mass torque |
|      (kg) |                (m) |             (Nm) |       (kg) |                 (m) |              (Nm) |       (kg) |                 (m) |              (Nm) |       (kg) |                 (m) |              (Nm) |
|-----------+--------------------+------------------+------------+---------------------+-------------------+------------+---------------------+-------------------+------------+---------------------+-------------------|
|        05 |                2.0 |            98.10 |         10 |                 1.0 |            -98.10 |         20 |                 0.5 |            -98.10 |            |                     |                   |
|        05 |                1.5 |            73.58 |         10 |                0.75 |            -73.58 |         15 |                 0.5 |            -73.58 |         30 |                0.25 |            -73.58 |
|        05 |                1.0 |            49.05 |         10 |                 0.5 |            -49.05 |            |                     |                   |            |                     |                   |
|        10 |                2.0 |           196.20 |         20 |                 1.0 |           -196.20 |         80 |                0.25 |           -196.20 |            |                     |                   |
|        10 |                1.5 |           147.15 |         15 |                 1.0 |           -147.15 |         30 |                 0.5 |           -147.15 |         60 |                0.25 |           -147.15 |
|        10 |                1.0 |            98.10 |         10 |                 1.0 |            -98.10 |         20 |                 0.5 |            -98.10 |            |                     |                   |
|        15 |                2.0 |           294.30 |         30 |                 1.0 |           -294.30 |         60 |                 0.5 |           -294.30 |            |                     |                   |
|        15 |                1.5 |           220.73 |         30 |                0.75 |           -220.73 |            |                     |                   |            |                     |                   |
|        15 |                1.0 |           147.15 |         10 |                 1.5 |           -147.15 |         20 |                0.75 |           -147.15 |         30 |                 0.5 |           -147.15 |
|        20 |                2.0 |           392.40 |         80 |                 0.5 |           -392.40 |            |                     |                   |            |                     |                   |
|        20 |                1.5 |           294.30 |         30 |                 1.0 |           -294.30 |         60 |                 0.5 |           -294.30 |            |                     |                   |
|        20 |                1.0 |           196.20 |         10 |                 2.0 |           -196.20 |         80 |                0.25 |           -196.20 |            |                     |                   |
|-----------+--------------------+------------------+------------+---------------------+-------------------+------------+---------------------+-------------------+------------+---------------------+-------------------|
#+TBLFM: $3='(format "%.2f" (* (string-to-number $1) (string-to-number $2) 9.81))
#+TBLFM: $5='(* (string-to-number $1) (/ (string-to-number $2) (string-to-number $4)))
#+TBLFM: $6='(format "%.2f" (* (string-to-number $4) (string-to-number $5) 9.81 -1))
#+TBLFM: $8='(* (string-to-number $1) (/ (string-to-number $2) (string-to-number $7)))
#+TBLFM: $9='(format "%.2f" (* (string-to-number $7) (string-to-number $8) 9.81 -1))
#+TBLFM: $11='(* (string-to-number $1) (/ (string-to-number $2) (string-to-number $10)))
#+TBLFM: $12='(format "%.2f" (* (string-to-number $10) (string-to-number $11) 9.81 -1)
